
## Plan Result




<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.civil-citizen-ui-cache-draft-store.azurerm_private_endpoint.this[0]
  * module.civil-citizen-ui-cache-draft-store.azurerm_redis_cache.redis
  * module.civil-citizen-ui-cache-draft-store.azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_key_vault_secret.redis_draft_store_access_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_draft_store_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_draft_store_access_key" {
        id                      = "https://civil-citizen-ui-aat.vault.azure.net/secrets/draft-store-access-key/c89fd7669e954cea95ad60685141d479"
        name                    = "draft-store-access-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
            "source"              = "redis civil-citizen-ui-draft-store-aat.redis.cache.windows.net"
        }
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.civil-citizen-ui-cache-draft-store.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "civil-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "civil-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "application"         = "civil"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "civil-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.civil-citizen-ui-cache-draft-store.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "civil-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "civil-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "application"         = "civil"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.civil-citizen-ui-cache-draft-store.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "civil-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "application"         = "civil"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-citizen-ui-aat|civil-citizen-ui-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "civil-citizen-ui-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1759,"Program":"tfcmt","SHA1":"","Vars":{}} -->